Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་ལྷ་འདུས་པ་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Now Lord Śākyamuni addressed the hosts of gods who were sitting among the entire assembly:

source: གྲོགས་པོ་དག་ཁྱེད་ཅག་ཉོན་ཅིག །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་སྔགས་སྒྲུབ་པའི་ཐབས་ཀྱི་ལས་བྱེད་པ། སྒྲུབ་པ་པོ་བསྲུང་བའི་ཕྱིར། མཆོག་ཏུ་གསང་བ་དམ་པ་སྙིང་པོ་དམ་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གསུངས་པ་རིག་པའི་རྒྱལ་པོ་ཆེན་པོ་བཟླས་པ་གང་གིས་སྔགས་ཐམས་ཅད་བཟླས་པར་འགྱུར་ཏེ
en: “Esteemed friends! Please listen to my discourse about the method for accomplishing the conduct, maṇḍala, and mantra of Mañjuśrī, the divine youth. Hear this great vidyārāja —the supremely secret and sublime heart mantra that was taught by all the tathāgatas for the sake of protecting the practitioner—by the uttering of which all mantras are uttered. {9.1}

source: ཀྱེ་ལྷའི་ཚོགས་དག་འདི་ནི་འདའ་བར་བྱ་བ་མ་ཡིན་ཏེ།
en: “This vidyārāja , O hosts of gods, is inviolable.

source: རིག་པའི་རྒྱལ་པོ་འདི་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཡང་རིག་པའི་རྒྱལ་པོ་འདིས་འགུགས་ཤིང་དབང་དུ་བྱེད་ལ།
en: With this vidyārāja even Mañjuśrī, the divine youth, can be summoned, enthralled, and made to comply.

source: འབྱོར་པ་མེད་པར་བྱེད་ན་
en: Why say more?

source: བྱང་ཆུབ་སེམས་དཔའ་གཞན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་སྔགས་ཐམས་ཅད་དང་། བགེགས་ཐམས་ཅད་ཀྱང་འཇིག་པར་བྱེད་དེ། འདི་ནི་སྟོབས་ཆེ་བ་དང་མཐུ་ཆེ་བ་དང་དཔའ་བོ་གཅིག་པ་དང་སྔགས་ཐམས་ཅད་ཀྱི་མཆོག་གཅིག་ཏུ་བསྟན་པ་དང་།
en: There are, O bodhisattvas, other mantras, both worldly and transcendental, but this unique mantra of great valor and power is said to be the best of all mantras—it can destroy all obstacles.

source: ཡི་གེ་གཅིག་པ་རྣམས་ཀྱི་ནང་ན་གཅིག་པར་བསྟན་པ་དང་།
en: Among all one-syllable mantras, only this one is called the syllable. {9.2}

source: ཡི་གེ་གཅིག་གིས་དོན་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ། བྱ་བ་ཐམས་ཅད་བྱེད་པ།
en: “This single syllable fulfills all purposes and accomplishes every task;

source: སྔགས་ཐམས་ཅད་གཅོད་པར་བྱེད་པ། མ་རུངས་པའི་ལས་རྣམས་ཀྱི་སྡིག་པ་ཐམས་ཅད་རབ་ཏུ་འཇིག་པར་བྱེད་པ།
en: it nullifies all the mantras of evildoers and removes all sins;

source: སྔགས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ།
en: it makes all the other mantras effective;

source: དགེ་བར་བྱེད་པ་དང་།
en: it brings that which is virtuous.

source: འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་སྔགས་རྣམས་ཀྱི་གོང་ནས་གོང་དུ་འདུག་པ།
en: It surpasses all other worldly and transcendental mantras.

source: ཐོགས་པ་མེད་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དེ་གང་ཞེ་ན།
en: It is the impeccable essence of all the tathāgatas that fulfills all wishes. Which mantra is this?

source: ཨོཾ་ནྠཱི་གྲོགས་པོ་དག་འདི་ཉིད་ནི་མཆོག་ཏུ་གསང་བ་དམ་པ་ལས་ཐམས་ཅད་བྱེད་པ། ཡི་གེ་གཅིག་པ་ཞེས་བྱ་བ་རིག་པའི་རྒྱལ་པོ་འདའ་བར་བྱ་བ་མ་ཡིན་པ།
en: It is kḷlhīṁ. {9.3} “Friends, this most secret vidyārāja called One Syllable can be employed in all rites. No being may transgress it;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཐུབ་པར་དཀའ་བ་འབྱུང་པོ་ཐམས་ཅད་ཀྱི་བཀྲ་ཤིས་པ། སངས་རྒྱས་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ།
en: it constitutes the auspiciousness of all the buddhas;

source: སྔགས་ཐམས་ཅད་ཀྱི་མངའ་བདག་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་དབང་ཕྱུག །རྣམ་པར་སྡང་བ་རྣམས་ལ་བྱམས་པའི་བདག་ཉིད་དང་སྐྱེ་བོ་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བར་བྱེད་པ།
en: it makes all mantras effective; it is the master of the worlds; it is the lord of all the lords of wealth; it is the love for all those who hate; it awakens the compassion of all beings;

source: བགེགས་ཐམས་ཅད་འཇིག་པར་བྱེད་པ་སྟེ།
en: and it is the remover of all obstacles.

source: མདོར་ན་ཅི་ལྟ་ཅི་ལྟར་རབ་ཏུ་སྦྱར་བ་དེ་ལྟ་དེ་ལྟར་ལས་བྱེད་དེ།
en: In short, whatever it is employed in, that very thing it will accomplish.

source: བསྒྲུབས་པ་མེད་ཀྱང་ལས་འགྲུབ་པར་འགྱུར་རོ། །
en: It can perform tasks even when it is not fully mastered. {9.4}

source: སྔགས་འདི་བཟླས་ལ་རེག་པས་དེ་དབང་དུ་འགྱུར་རོ། །
en: “Whomever one touches while reciting this mantra will become enthralled.

source: གོས་ལ་བསྔགས་ནས་གྱོན་ན་སྐལ་བ་བཟང་པོར་འགྱུར་རོ། །
en: If one wears incanted clothes, one will obtain good fortune.

source: སོ་ཤིང་ལ་བསྔགས་ན་སོ་ནད་ཉེ་བར་ཞི་བར་འགྱུར་རོ། །
en: If one bites an incanted tooth stick, one will get rid of a toothache.

source: ཀ་ར་བཱི་ར་དཀར་པོའི་སོ་ཤིང་ལ། ལན་བདུན་བསྔགས་ཏེ་ཟོས་ན་དོན་དུ་མ་གཉེར་བར་ཡང་ཁ་ཟས་འབྱུང་བར་འགྱུར་རོ། །
en: If one bites an incanted tooth stick from the white oleander tree, food will be found without one’s having to ask for it. {9.5}

source: མིག་གི་ནད་ལ་རྒྱམ་ཚྭ་བཏགས་ཏེ་ལན་བདུན་མངོན་པར་བསྔགས་ལ་མིག་བཀང་ན་མིག་གི་ནད་སེལ་ཏོ། །
en: “If one has eye pain, one should grind sea salt, incant it seven times, and apply it to the eye. This will remove the pain.

source: རྣ་བའི་ནད་ལ་འབྲུག་སྒྲོགས་པ་ལས་སྐྱེས་པའི་རྩྭ་ཚ་ཏྲི་ཀ་ཞེས་བྱ་བ། གླང་པོ་ཆེའི་རྒྱབ་ཏུ་རེག་པར་བྱས་ལ། རང་གི་ལོ་མའི་ནང་དུ་བཏུམས་ནས་མེ་ཆུང་བ་ལ་བསྲེགས་ཏེ་ཤིན་ཏུ་འཇམ་པར་བྱས་ལ།
en: If one has an earache, one should take a mushroom that has grown in elephant dung while it thundered, wrap it in a leaf of kedhuka, and cook it over a low fire until it is well cooked.

source: རྒྱམ་ཚྭའི་ཕྱེ་མ་ཆུ་དྲོ་འཇམ་ཙམ་དང་སྤྲུས་ཏེ་ལན་བདུན་བསྔགས་པས་རྣ་བ་བཀང་བ་དང་།
en: Having then added a lukewarm solution of sea salt, one should incant the decoction seven times and pour it into the ear.

source: སྐད་ཅིག་དེ་ཉིད་ལ་རྣ་བ་ན་བ་ཉེ་བར་ཞི་བར་འགྱུར་རོ། །
en: The pain will be assuaged at that moment. {9.6}

source: བུད་མེད་བུ་འབྱུང་བའི་དུས་སུ་མངལ་ནས་མཐོན་ཏེ། ན་ཞིང་ཉམ་ཐག་པ་ལ་ནི་ཤིང་ཨཱ་ཌཱ་རུ་ཤ་ཀའི་རྩ་བ་སྲོག་ཆགས་མེད་པའི་ཆུ་ལ་བཏགས་ཏེ་ལྟེ་བའི་ཕྱོགས་སུ་བསྐུས་ན་ཉེ་བར་ཞི་བར་འགྱུར་རོ། །
en: “If, at the time of giving birth, a woman is having a difficult delivery and is overcome with pain, one should grind the root of Malabar nut with water that is free of living organisms and smear it over the navel area. She will give birth with ease.

source: མཚོན་ནང་དུ་ལུས་པའི་སྐྱེས་བུ་ལ་ནི་མར་རྙིང་པ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་མངོན་པར་བསྔགས་ཏེ། བཏུང་བའམ་བྱུགས་ན་ཕྱོགས་དེ་ནས་དེའི་སྐད་ཅིག་ལ་ཟུག་རྔུ་མེད་པར་འགྱུར་རོ། །
en: If a person with a splinter in his flesh drinks old ghee incanted one hundred and eight times, or smears it over the affected area, the splinter will come out. {9.7}

source: མ་ཞུ་བ་དང་གསུད་པ་དང་། འཁྲུ་བའི་ནད་ལ་ནི་ལན་ཚྭ་ནག་པོ་འམ་རྒྱམ་ཚྭ་འམ་ཚྭ་གཞན་གང་ཡང་རུང་བ་ལ་ལན་བདུན་བསྔགས་ཏེ་ཟོས་ན་
en: “In the case of indigestion with vomiting and dysentery, one should incant seven times some sochal salt, sea salt, or other type of salt, and eat it.

source: ནད་དེ་ལས་གྲོལ་བར་འགྱུར་ཏེདེ་ཉིད་ཀྱི་ཉིན་པར་བདེ་ལེགས་སུ་འགྱུར་རོ། །
en: One will be free from this disease the same day and will become well.

source: ལྡན་པའི་ནད་ཀྱི་ཚད་པས་འཁྲུ་བ་འམ། འཁྲུ་བ་ལ་ནི་མ་དུ་ལུང་གའི་རྩ་བ་བཏགས་ཏེ། ལན་གཅིག་གམ་གཉིས་བཟླས་པ་བྱས་ནས་སྲོག་ཆགས་མེད་པའི་ཆུ་དང་འཐུངས་ན་གནོད་པ་མེད་པར་དེ་ལས་གྲོལ་བར་འགྱུར་རོ། །
en: In the case of the twofold dysentery or a sudden dysentery, one should mash the fruits of citron with water that is free of living organisms and has been incanted once or more. By this method one will be freed from the unpleasant symptoms. {9.8}

source: བུད་མེད་མོ་ཤམ་བུ་མི་སྐྱེ་བ་སྐྱེ་བར་འདོད་ན། ཨ་ཤྭ་གན་དྷའི་རྩ་བ་མར་བཟང་པོ་དང་ལྷན་ཅིག་བསྐོལ་ལ། བའི་འོ་མ་དང་ལྷན་ཅིག་བསྐོལ་ཏེ་བའི་འོ་མ་དང་བསྲེས་ལ་
en: “In the case of a barren woman, or a woman who wants but is unable to conceive, one should cook the root of winter cherry with ghee, blend it with cow’s milk, and dilute it with more milk.

source: ལན་ཉི་ཤུ་རྩ་ལྔར་བཟླས་ལ་ཟླ་མཚན་གྱི་དུས་སུ་བླུད་ལ་ཁྲུས་བྱས་པའི་འོག་ཏུ་ཁྱིམ་བདག་གཞན་གྱི་ཆུང་མ་སྤངས་ཤིང་འདོད་པས་ལོག་པར་གཡེམ་པ་སྤངས་པས། རང་གི་ཆུང་མ་ལ་མངོན་པར་སོང་ན་རང་གི་ཁྱོ་དང་འདྲ་བའི་བུ་སྐྱེ་བར་འགྱུར་རོ། །
en: One should incant it twenty-five times and give it to such a woman to drink during her period, after bathing. The householder-husband, staying away from the wives of others and avoiding inappropriate sexual conduct, should then approach her sexually, or she him. She will then conceive a son. {9.9}

source: ལོ་གསུམ་མམ་ལོ་ལྔའི་བར་དུ་བུ་བཙའ་བའི་དུས་སུ་ཁྲག་འབྱུང་བ་འམ།
en: “If she experiences bleeding within the next three to five years when she is with child;

source: ལོ་དུ་མའི་བར་དུ་བུ་མ་ཆགས་པ་འམ།
en: if she does not conceive a child for many years;

source: གཞན་གྱི་སྔགས་རྒྱུད་དང་སྨན་དང་གཞན་གྱི་ཕྱག་རྒྱས་བཅིངས་པ་དང་། གཞན་གྱིས་མ་རུངས་པར་བྱས་པའམ།
en: if she is harmed by the mantra magic, medicines, or mudrās of others;

source: བུ་ཟླ་བ་མ་ཚང་བར་བྱུང་བ་འམ།
en: if she suffers a miscarriage;

source: ནད་ལས་ཡང་དག་པར་བྱུང་བ་འམ།
en: if she falls ill;

source: གཞན་གྱི་སྦྱོར་བས་ཡང་དག་པར་བྱུང་བ་འམ།
en: if there is any other disorder caused by others;

source: གཞན་གང་ཡང་རུང་བ་ཅུང་ཟད་གཞན་གྱིས་བྱས་པའི་ནད་དང་། གནས་པ་དང་འགྲོ་བ་དང་བཅོས་མ་དང་། བཅོས་མ་མ་ཡིན་པའི་དབྱིག་དུག་ལ་སོགས་པ་བྱིན་པ་འམ་རྩ་བ་དང་སྨན་དང་སྔགས་ཐམས་ཅད་དང་། མཛའ་བ་དང་མི་མཛའ་བས་སྦྱོར་བ་བྱས་པ་ལ་ལན་ཉི་ཤུ་རྩ་བདུན་བསྔགས་ཏེ
en: or if she is poisoned by animate or inanimate, or natural or artificial means—if any of this was effected by the friendly or hostile use of any root or medicine mantras, one should chant the mantra twenty-seven times

source: མར་རྙིང་པ་ལ་རྨ་བྱའི་སྒྲོ་ཟླ་བ་འདྲ་བ་དང་བསྲེས་ཏེ་བཏགས་ལ་དེ་ནས་ཤིན་ཏུ་ཞིབ་པར་བྱས་ལ་ཤ་ཁ་ར་དང་ལྷན་ཅིག་སྦྱར་ཏེ། ཨ་རུ་ར་ཙམ་བཟའ་བར་བྱའོ། །ཞག་བདུན་གྱི་བར་དུ་ཁ་ར་དང་ལྡན་པའི་བསྐོལ་བ་བཏུང་བར་བྱ་སྟེ།
en: and then grind old ghee with the moon-like eye of a peacock feather, making it homogenous. When it is finely ground, one should mix it with sugar and eat an amount the size of myrobalan fruit every day over seven days. {9.10} “The patient should be made to drink milk cooked with sugar,

source: ཡང་དང་ཡང་དུ་སྔགས་ཀྱང་བཟླ་བར་བྱའོ། །
en: having incanted it again and again.

source: མགོ་བོའི་ནད་ལ་ནི་ཁྭའི་གཤོག་པ་ལ་ལན་བདུན་བསྔགས་ཏེ་བྱབས་ན་བདེ་ལེགས་སུ་འགྱུར་རོ། །
en: If one has a headache, one should wipe the head with a crow’s pinion incanted seven times. One will become well. {9.11}

source: བུད་མེད་ལ་སྤྱད་དྲགས་པ་ལ་སོགས་པའི་ནད་ནི་ཤིང་ཨ་ལ་མ་བུ་སའི་རྩ་བའི་ལོ་མ་དང་ལྷན་ཅིག་བཏགས་ནས། སྨན་ནི་ལི་ཀའི་རྩ་བ་དང་ལྡན་པ་ལ་བརྒྱ་རྩ་བརྒྱད་བསྔགས་ཏེ་འོ་མ་དེ་དང་བསྲེས་ལ་བཏུང་བར་བྱའོ། །
en: “For female disease such as hypermenorrhea, one should grind the root of nīlikā together with milk, add to it some root of the indigo plant, and incant this one hundred and eight times. One should then blend it with milk and give it to the patient to drink.

source: དེ་བཞིན་དུ་རིམས་ཉིན་གཅིག་པ་དང་ཉིན་གཉིས་པ་དང་ཉིན་གསུམ་པ་དང་ཉིན་བཞི་པ་དང་། ཐེར་ཟུག་པའི་རིམས་དང་། རྟག་པའི་རིམས་དང་རིམས་མི་བཟད་པ་ལ་སོགས་པ་ལ་འོ་ཐུག་མར་དང་ལྡན་པ་ལ་བརྒྱ་རྩ་བརྒྱད་མངོན་པར་བསྔགས་ཏེ་བླུད་པ་བྱས་ན་
en: Similarly, in the case of a fever, be it a quartan, one-day, two-day, three-day, chronic, constant, or recurrent one, one should have the patient drink milk with ghee, incanted one hundred and eight times.

source: བདེ་བར་གནས་པར་འགྱུར་རོ། །
en: The patient will become well. {9.12}

source: དེ་བཞིན་དུ་མཁའ་འགྲོ་མའི་གདོན་གྱིས་ཟིན་པ་དག་ལ་ནི། བདག་ཉིད་ཀྱི་གདོང་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་མངོན་པར་བསྔགས་ཏེ་ནད་པ་ལ་བལྟས་ན་
en: “Similarly, if someone is seized by a ḍākinī or a graha, one should incant one’s own face one hundred and eight times and face the affected person;

source: དེ་བཞིན་དུ་མ་མོ་དང་བྱིས་པ་དང་ལུས་སྲུལ་པོ་དང་རོ་ལངས་དང་གཞོན་ནུའི་གདོན་ལ་སོགས་པ་མི་མ་ཡིན་པའི་མི་བཟད་པའི་གདོན་ཐམས་ཅད་ཀྱིས་ཟིན་པ་ལ་ནི།
en: Similarly, if someone is seized by any terrible and evil nonhuman being, such as a mātṛkā, a pūtanā that attacks children, a vetāla, or a graha that seizes children,

source: བདག་ཉིད་ཀྱི་ལག་པ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་མངོན་པར་བསྔགས་པ་བྱས་ནས་གདོན་གྱིས་ཟིན་པའི་མགོ་ལ་རེག་པར་བྱས་ན་
en: one should incant one’s own hand one hundred and eight times and touch the affected person on the head.

source: ལན་ཅིག་བཟླས་པས་བདག་ཉིད་བསྲུང་བར་འགྱུར་རོ། །
en: “A single repetition of the mantra will protect oneself;

source: ལན་གཉིས་བཟླས་པས་གྲོགས་པོ་བསྲུང་བར་འགྱུར་རོ། །
en: a double repetition, one’s friends;

source: ལན་གསུམ་བཟླས་པས་ཁྱིམ་བསྲུང་བར་འགྱུར་རོ། །
en: a triple one, one’s house;

source: ལན་བཞི་བཟླས་པས་ནི་གྲོང་བསྲུང་བར་འགྱུར་རོ། །
en: a fourfold one, one’s village;

source: ལན་ལྔ་བཟླས་པས་ནི་གྲོང་གི་སྤྱོད་ཡུལ་གྱི་འགྲོ་བ་བསྲུང་བར་འགྱུར་རོ། །
en: a fivefold one, everybody within the greater village area;

source: དེ་བཞིན་དུ་ལན་སྟོང་གི་བར་དུ་བཟླས་ན་དམག་གི་ཚོགས་བསྲུང་བ་བྱས་པར་ཡང་འགྱུར་རོ། །
en: up until, with one thousand repetitions, one may protect an army.

source: དེ་དག་དང་གཞན་ཡང་མ་བསྒྲུབས་པར་ལས་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ། །
en: One may perform these and all the other similar minor acts, even if one has not fully mastered the mantra. {9.14}

source: ཅི་སྟེ་སྒྲུབ་པར་འདོད་ན་ནི་ལས་ཕྲན་ཚེགས་རྣམས་བྱ་བ་མ་ཡིན་ཏེ།
en: “One who desires accomplishment should not engage in trivial activities.

source: གཅིག་པུ་དབེན་པའི་གནས་སུ་སོང་ནས་རྒྱ་མཚོར་འབབ་པའི་ཆུ་བོ་འབྱུང་བའི་གནས་དང་། རྒྱ་མཚོའི་ངོགས་དང་ཆུ་བོ་གང་གཱའི་ངོགས་དང་། གཞན་གང་ཡང་རུང་བའི་ཆུ་བོ་ཆེན་པོའི་ངོགས་ལ་བརྟེན་ནས
en: One should go alone to a secluded place at the source of a river that flows into the ocean or on the ocean shore, on the bank of the Gaṅgā, or on the bank of any big river.

source: གཙང་མའི་གནས་སུ་ལོ་མའི་སྤྱིལ་པོ་བྱས་ཏེ།
en: There, in a clean spot, one should build a hut.

source: ཁྲུས་ལན་གསུམ་བྱ་ཞིང་གོས་ལན་གསུམ་བརྗེས་ལ། ཐུབ་པར་གནས་ཤིང་སློང་མོའི་ཁ་ཟས་བཟའ་བའམ་ཚོད་རྔད་དམ། ཁྱོར་གང་ཙམ་མམ་འོ་མ་འམ། འབྲས་བུ་ཟ་ཞིང་བཟླས་པ་སུམ་འབུམ་བྱས་ཏེ
en: One should perform the threefold ablutions, wear the three garments, observe silence, and live on food obtained by begging or on the practitioner’s diet of milk, barley, and fruit. Living thus, one should recite the mantra three million times.

source: གྲུབ་པའི་མཚན་མ་མཐོང་ན་དེ་ནས་སྒྲུབ་པ་བརྩམ་པར་བྱའོ། །
en: Then, once the sign has been observed, one should commence the sādhana practice. {9.15}

source: ཕྱོགས་དེ་ཉིད་དུ་རས་རིས་ཆེན་པོ་བཞག་ལ། རས་རིས་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ཏེ། མར་མེའི་སྣོད་གསེར་རམ་དངུལ་ལམ་ཟངས་སམ་སའི་རང་བཞིན་ལ། ཤིང་དུ་རུ་སྐའི་འབྲུ་མར་གྱིས་བཀང་བའམ་དྲི་ཞིམ་པོའི་འབྲུ་མར་གྱིས་བཀང་བ་འམ་བའི་མར་གྱིས་ཡོངས་སུ་བཀང་བའི་མར་མེ་རས་ཀྱི་དུམ་བུ་སར་པའི་སྙིང་པོ་བྱས་ཏེ་རས་རིས་ཀྱི་མདུན་དུ་འབུམ་ཕྲག་གཅིག་གི་མར་མེ་དབུལ་བར་བྱའོ། །
en: “On that location, in the same place, one should install the superior painting and offer a big pūjā with lamps of gold and silver, or of copper and clay, filled with olibanum oil or ghee, with wicks made of high-quality fabric. One should prepare one hundred thousand such lamps and offer all of them before the painting. {9.16}

source: ཁོ་ར་ཁོར་ཡུག་ཏུ་མར་མེའི་ཕྲེང་བ་ཕུལ་མ་ཐག་ཏུ་རས་རིས་ལས་འོད་འབྱུང་སྟེ།
en: “With the lighted lamps evenly arranged in contiguous rows, light will radiate from the painting.

source: འོད་བྱུང་མ་ཐག་ཏུ་རས་རིས་ཀྱི་ཁོ་ར་ཁོར་ཡུག་ཏུ་འོད་འབར་བའི་ཕྲེང་བས་ཀུན་ནས་ཁྱབ་པར་འགྱུར་རོ། །
en: The moment the light shines, the painting will be haloed with a blazing ring of light that pervades everywhere.

source: སྟེང་གི་ནམ་མཁའ་བར་སྣང་ལས་རྔ་བོ་ཆེའི་སྒྲ་སྒྲོགས་ཤིང་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་ཡང་ཐོས་ཏེ།
en: In the sky above drums will sound and congratulatory cheers will be heard. {9.17}

source: དེ་ནས་རིག་པ་འཛིན་པས་རིངས་པའི་ཚུལ་གྱིས་སྒྲུབ་པ་པོས་རས་རིས་ཀྱི་མཐའ་ལ་སྔར་བྲིས་པའི་རས་རིས་ཀྱི་མཐའ་ནས་མཆོད་ཡོན་གསོལ།
en: “At that point, a vidyādhara, in a form that delights sentient beings, will emerge from the corner where the practitioner is depicted on the previously painted cloth.

source: ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ནས་གཟུང་བར་བྱའོ། །
en: One should give him a welcome offering, circumambulate him, bow to all the buddhas, and seize him.

source: དེ་ནས་དེ་བཟུང་བ་ཙམ་གྱིས་མར་མེ་ཐམས་ཅད་འཛིན་པའི་སེམས་ཅན་རྣམས་གཅིག་གིས་ལྷག་པའི་གཞལ་མེད་ཁང་འབུམ་དང་ལྷན་ཅིག་འཕུར་བར་འགྱུར་རོ། །
en: As soon as one has seized him, one will fly up together with all the beings holding lamps and, perhaps, ascend to 100,001 palaces.

source: ལྷའི་སིལ་སྙན་དང་ཡང་དག་པར་ལྡན་པ་དང་། གླུ་སྙན་པའི་སྒྲ་ལ་སོགས་པ་དང་ལྡན་པ་དང་། གར་དང་ལྡན་པའི་རིག་པ་འཛིན་མ་འཁོར་ཡུག་ཏུ་ཁྱབ་པ་དག་གིས་མར་མེ་ཐོགས་པ་དང་ལྷན་ཅིག་སྒྲུབ་པ་པོ་རིག་པ་འཛིན་པའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་དབང་སྐུར་བར་བྱེད་དོ། །
en: Surrounded by vidyādharīs playing divine instruments, singing songs in sweet voices, and dancing, one will be consecrated by them to kingship as a vidyādhara-cakravartin.

source: རྒ་བ་དང་འཆི་བ་མེད་པས་རོལ་པར་འགྱུར་ཞིང་། བསྐལ་པ་ཆེན་པོར་གནས་ཤིང་ཉི་མ་དང་འདྲ་བ་དང་། ལྷའི་ཡན་ལག་ལྟ་བུར་མཛེས་པ་དང་། གོས་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་དང་། འཁོར་དེ་དག་དང་ཡང་འདི་ལྷན་ཅིག་ཏུ་སྤྱད་པར་འགྱུར་རོ། །
en: Together with the holders of the lamps, one will revel in freedom from old age and death, endure for a great eon, have the luster of the rising sun and divinely beautiful limbs, and be adorned with a diverse array of garments. {9.18}

source: རིག་པ་འཛིན་པ་ཐམས་ཅད་ཀྱང་འདིའི་བྲན་བཞིན་དུ་ཉེ་བར་གནས་པར་འགྱུར་ཏེ།
en: “The vidyādharas, for their part, will become one’s servants.

source: རིག་པ་འཛིན་པའི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ། །
en: One will become a monarch of vidyādharas.

source: རིང་དུ་འཚོ་བ་དང་གྲུབ་པ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པར་འགྱུར་རོ། །
en: One will have a long life and be unassailable.

source: རིག་པ་འཛིན་པ་རྣམས་ཀྱི་བུ་མོ་རྣམས་ལ་མཆོག་ཏུ་ཡིད་དུ་འོང་བར་འགྱུར་རོ། །
en: One will be the supremely fortunate one among all the celestial siddha s—an enthraller of vidyādhara girls.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྒྱལ་མཚན་གྱི་རྩེ་མོ་ལ་བཞུགས་པར་འགྱུར་རོ། །
en: One will worship the buddhas and bodhisattvas with every substance.

source: སྐད་ཅིག་གིས་ཚངས་པའི་འཇིག་རྟེན་དུ་འགྲོ་ཞིང་བརྒྱ་བྱིན་ལ་ཡང་བགྲང་བ་མེད་ན། རིག་པ་འཛིན་པ་གཞན་ལྟ་ཅི་སྨོས།
en: One will be able to ascend even to the world of Brahmā in an instant. One will not even need to consider Śakra, let alone other vidyādharas.

source: འདི་ནི་མཐར་ཡང་སངས་རྒྱས་ཉིད་དུ་འགྱུར་ཞིང་།
en: In the end, one will attain the state of awakening.

source: འཕགས་པ་འཇམ་དཔལ་ཡང་འདིའི་དགེ་བའི་བཤེས་གཉེན་དུ་འགྱུར་རོ། །
en: Noble Mañjuśrī will become one’s spiritual friend. {9.19}

source: གཞན་ཡང་ལས་ཀྱི་སྒྲུབ་པ་པོ་ཡོད་དེ། དེ་ནས་ཤིན་ཏུ་བརྩོན་པས་གཅིག་པུ་དབེན་པ། སྐྱེ་བོ་མེད་ལ་འདྲེས་པ་མེད་ཅིང་འདྲེས་པ་དང་བྲལ་བས་དགོན་པ་ཆེན་པོར་ཞུགས་ཏེ།
en: “There are, however, those practitioners whose sādhana practice is more intense. In such a case, one should go alone to a secluded place free from the distractions of attachment.

source: གནས་གང་དུ་པདྨ་ཆེན་པོ་ཡོད་པའི་མཚོ་དང་ལྡན་པའི་རིའི་རྩེ་མོ་གཅིག་ཏུ་བརྟེན་ནས།
en: One should retreat to a big forest and find a place where there is a lotus pond adjacent to a lonely mountain and fed by a stream.

source: རིའི་རྩེ་མོ་དེའི་སྟེང་དུ་འཛེགས་ཏེ། རིག་པའི་རྒྱལ་པོ་ཡི་གེ་གཅིག་པ་འཇམ་དཔལ་གྱི་ཆོ་ག་ལས་བཤད་པའམ། དེ་བཞིན་གཤེགས་པའམ། གཞན་བྱང་ཆུབ་སེམས་དཔས་བཤད་པའམ། གང་ཡང་རུང་བའི་སྔགས་འདོད་པ་དེ་དག་བཟུང་སྟེ།
en: One should climb to the top of the mountain and, having chosen either the single-syllable vidyārāja taught in the Mañjuśrī’s manual of rites, one taught by the Tathāgata or another bodhisattva, or any other one prefers,

source: པདྨའི་རྩ་བའམ་འོ་མའི་ཁ་ཟས་ཀྱིས་འཚོ་ཞིང་། རིག་པ་འབུམ་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་བཟླས་ལ། བཟླས་པའི་མཐར་ཆོ་ག་དེ་ཉིད་ཀྱིས་སྔར་བསྟན་པའི་རས་རིས་ཀྱི་རི་མོ་ཆེན་པོ་རབ་ཏུ་བཞག་སྟེ
en: one should live on lotus roots and milk products, recite the vidyāmantra three million six hundred thousand times. At the end of the recitation, one should install, following the same procedure as previously taught, the superior one of the previously taught types of painting and

source: མེ་ཏོག་པདྨ་ལ་ཙནྡན་དཀར་པོ་དང་། གུར་གུམ་གྱིས་བཏགས་ལ་སེང་ལྡེང་གི་ཤིང་གི་མེ་སྦར་ཏེ། སྔར་ཡོངས་སུ་བཏགས་པའི་མེ་ཏོག་གིས་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་དྲུག་གི་སྦྱིན་སྲེག་བྱའོ། །
en: prepare the lotus flowers smeared with white sandalwood and saffron paste. Having lit a fire of cutch tree sticks, one should offer into the fire the already-prepared lotuses thirty-six thousand times. {9.20}

source: དེ་ནས་སྦྱིན་སྲེག་གི་མཐར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་རས་རིས་ལས་འོད་ཟེར་འབྱུང་ངོ་། །
en: “Then, at the conclusion of the homa rite, rays of light will issue forth from the painting of Lord Śākyamuni.

source: དེ་ནས་སྒྲུབ་པ་པོ་སྣང་བར་བྱས་ཏེ། སྤྱི་བོར་ཞུགས་པར་འགྱུར་ལ་དེས་རེག་མ་ཐག་ཏུ་སྒྲུབ་པ་པོས་མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་པར་འགྱུར་རོ། །
en: Having illumined the practitioner, they will dissolve into his head. As soon as one is touched by these rays, one will attain the five superknowledges.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཐོབ་པར་འགྱུར། ལྷའི་ལུས་ཀྱིས་ཅི་ལྟར་འདོད་པ་བཞིན་དུ་འགྲོ་བར་འགྱུར།
en: Having attained the levels of a bodhisattva, one will go about as one pleases in the form of a god.

source: བསྐལ་པ་སུམ་ཅུ་རྩ་དྲུག་གི་བར་དུ་འཚོ་བར་འགྱུར།
en: One will live thirty-six eons

source: སངས་རྒྱས་ཀྱི་ཞིང་སུམ་ཅུ་རྩ་དྲུག་གནོན་པར་འགྱུར།
en: and will traverse thirty-six buddhafields,

source: དེ་དག་གི་མཐུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་འགྱུར།
en: beholding all their might.

source: སངས་རྒྱས་སུམ་ཅུ་རྩ་དྲུག་གི་གསུང་རབ་འཛིན་པར་འགྱུར།
en: One will memorize the teachings of the thirty-six buddhas

source: དེ་ལ་མཆོད་ཅིང་བསྙེན་བཀུར་བ་ལ་མངོན་པར་དགའ་བར་འགྱུར།
en: and will delight in worshiping and serving them.

source: མཐར་ཡང་བྱང་ཆུབ་ལ་གཞོལ་བར་འགྱུར།
en: In the end, dedicated to the attainment of awakening,

source: འཕགས་པ་འཇམ་དཔལ་གྱིས་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་པ། མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ་དགེ་བའི་བཤེས་གཉེན་དུ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །
en: one will be wholly taken care of by the spiritual friend, Noble Mañjuśrī, right until the ultimate state of awakening, the final nirvāṇa.” {9.21}

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་མདོ་སྡེ་འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་དགུ་པའི་ལེའུ་རབ་འབྱམ་ལས། གཉིས་པ་སྒྲུབ་པའི་ཐབས་དམ་པའི་ལས་ཀྱི་ལེའུ་རབ་འབྱམ་རྫོགས་སོ།། །།
en: This concludes the ninth chapter of “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings. This chapter constitutes the detailed second chapter on the ritual involving the supreme sādhana method.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་སྒྲུབ་པའི་ལས་དམ་པ་གཞན་ཡང་གསུངས་ཏེ།
en: At that time Lord Śākyamuni taught yet another supreme ritual practice:

source: ཆོ་གའི་རྒྱལ་པོ་འདི་ལས་གང་ཡང་རུང་བའི་སྔགས་བཟུང་ནས། གང་གཱའི་ཀླུང་ཆེན་པོར་ཞུགས་ཏེ།
en: “Having chosen another mantra from this king of manuals, one should go down to [the bank of] the great river Gaṅgā.

source: དཀྱིལ་དུ་གྲུའི་བཞོན་པ་ལ་འདུག་སྟེ། འོ་མ་དང་སྦྱར་བའི་འབྲས་ཆན་ཟ་ཞིང་ཅི་ལྟར་འདོད་པའི་ཉི་མ་ལ་བཟླས་པ་སུམ་འབུམ་བྱའོ། །
en: Staying in a boat in the middle of the river, one should incant rice gruel mixed with milk three million times on the days of one’s choice.

source: དེ་ནས་བཟླས་པའི་ཐ་མ་ལ་ཀླུ་ཐམས་ཅད་མཐོང་སྟེ།
en: Subsequently, at the end of recitation, one will perceive all the nāga s.

source: དེ་ནས་བསྒྲུབ་པ་བརྩམ་པར་བྱའོ། །
en: One should then start the main practice.

source: གྲུའི་སྟེང་དེ་ཉིད་ཀྱི་ནང་དུ་མེ་ཐབ་པདྨའི་རྣམ་པ་འདྲ་བ་བྱས་ནས།
en: For that, one should prepare, in the middle of the boat, a fire pit in the shape of a lotus.

source: མེ་ཏོག་ནཱ་ག་གེ་སར་དག་གིས་རས་རིས་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ཏེ།
en: One should prepare a big offering of ironwood blossoms to the painting.

source: རས་རིས་ཆེན་པོ་ནུབ་དུ་བསྟན་པས་བཞག་ལ། བདག་ཉིད་ཤར་དུ་བལྟས་ནས་ཀུ་ཤའི་ཁྲེས་ལ་འདུག་སྟེ།
en: The painting of the superior type should be positioned facing west, with oneself sitting on a bundle of kuśa grass facing east.

source: མེ་ཏོག་ནཱ་ག་གེ་སར་རེ་རེ་ལ་ཡང་ལན་བདུན་བདུན་བསྔགས་པ་བྱས་ནས།
en: One should incant each of the ironwood blossoms seven times

source: ཤིང་སེང་ལྡེང་གིས་མེ་སྦར་བ་ལ་སྦྱིན་སྲེག་བྱ་སྟེ།
en: and offer it into the blazing fire of cutch tree sticks.

source: ཙནྡན་དཀར་པོ་དང་གུར་གུམ་དང་བསྲེས་པའི་མེ་ཏོག་ནཱ་ག་གེ་སར་གྱིས་ལན་སྟོང་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་གི་བར་དུ་བྱ་སྟེ།
en: One should do this until one has offered thirty thousand such blossoms, each smeared with white sandalwood and saffron paste.

source: གཞན་གྱིས་ནི་མ་ཡིན་ནོ། །
en: One should use nothing else.

source: ཀླུ་རྣམས་མཐོང་བ་ཡང་དོན་ཡོད་པ་ཡིན་ཏེ།
en: One should wait for the nāga s to appear.

source: གྲུབ་པའི་རྫས་རྣམས་ལ་རབ་ཏུ་ཆགས་པས་བླང་བར་མི་བྱ་སྟེ། གྲུབ་པའི་རྫས་རྣམས་ལ་ཆགས་པས་ལེན་པར་མི་བྱེད་ན།
en: They will be enticed by the power substances, but will not take them. {10.1}

source: དེས་ན་སྦྱིན་སྲེག་རྫོགས་པ་དང་གྲུའི་བཞོན་པ་དང་བཅས་པར་འཕུར་བར་འགྱུར་ཏེ།
en: “Then, at the conclusion of the homa ritual, one will fly up together with the boat.
